Dlubal.DynamPro.HorizontalAlignmentType
Type of horizontal alignment

Dlubal.DynamPro.HorizontalAlignmentType.UnknownHAlignment
Unknown horizontal alignment

Dlubal.DynamPro.HorizontalAlignmentType.Left
Left alignment

Dlubal.DynamPro.HorizontalAlignmentType.Center
Center alignment

Dlubal.DynamPro.HorizontalAlignmentType.Right
Right alignment